namespace ComputerCompany.Application.Client.Services;

public static class Constants
{
    public const string AboutCompany = "Компания по сборке ПК предлагает услуги по разработке и продаже персональных компьютеров, а также сопутствующие услуги, такие как установка программного обеспечения, настройка оборудования и консультации по выбору комплектующих.\r\nСборка ПК включает выбор и закупку качественных компонентов, таких как материнская плата, процессор, видеокарта, оперативная память, жёсткий диск или SSD, блок питания и корпус. Затем специалисты компании собирают компьютер, устанавливают операционную систему и драйверы, а также проводят тестирование системы на стабильность и производительность.\r\nКак работает компания:\r\n1.\tСобираем компьютеры по индивидуальным заказам\r\n–\tПомогаем подобрать подходящие детали для компьютера\r\n–\tСобираем всё в единую систему\r\n–\tПроверяем, чтобы все части компьютера работали вместе без проблем\r\n–\tУстанавливаем необходимые программы\r\n2.\tНастраиваем программное обеспечение\r\n–\tУстанавливаем Windows или Linux\r\n–\tНастраиваем систему для игр или работы\r\n–\tОптимизируем производительность\r\nКомпания также может предложить услуги по кастомизации ПК, то есть созданию индивидуальных конфигураций компьютера с учётом потребностей клиента. Это может включать установку дополнительных компонентов, таких как звуковые карты, сетевые адаптеры, оптические приводы и другие периферийные устройства.\r\n";
    public const string WeInSociatlNetworks = 
    "Наши ресурсы: \n" +
     "VK: https://vk.ru/ComputerCompan \n" +
     "Telegram: https://t.me/ComputerCompany \n";
    public const string Licence =
"ЛИЦЕНЗИЯ \n" +
"А 608786\n" +
"Регистрационный номер 981256 от «12» Мая 2025\n" +
"\n" +
"Федеральная служба по регулированию алкогольного рынка\n" +
"разрешает осуществление следующего вида деятельности: розлив, хранение и поставка алкогольной продукции.\n" +
"\n" +
"Лицензия выдана\n" +
"\n" +
"ГУ МВД России по Самарской области" +
"\n" +
"Условия осуществления данного вида деятельности:\n" +
"Средства организации\n" +
"Полное управление\n" +
"М.П.\n" +
"Подпись\n" +
"О.Б. Галанина\n" +
"\n" +
"Сведения о регистрации лицензии на территориях субъектов Российской Федерации\n" +
"\n" +
"М.П.\n" +
"Подпись\n" +
"Г.И. Синих";
}